src/ex_Tabakon/DataProcessors/ТБК_ВыгрузкаПродажДляИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТБК_ВыгрузкаПродажДляИнвентаризации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/ex_Tabakon/Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пробитый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Аннулированный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/ОтчетОРозничныхПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтчетОРозничныхПродажах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплатыНаличных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПлатежнымиКартами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АкцизныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/DataProcessors/ТБК_ВыгрузкаПродажДляИнвентаризации/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)	
	
	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать продажи'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='JSON (*.json)|*.json'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);

		
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Выгрузки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			продажиЗаПериод = ВыгрузитьВФайлНаСервере(
				ЭтаФорма.ПериодВыгрузки.ДатаНачала, 
				ЭтаФорма.ПериодВыгрузки.ДатаОкончания
			);
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.ОткрытьФайл(имяФайла);
			ЗаписатьJSON(ЗаписьJSON,продажиЗаПериод);
			ЗаписьJSON.Закрыть();
			
			Сообщить("Файл сформирован: "+ИмяФайла)
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыгрузитьВФайлНаСервере(датаН, датаК)
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Продажи.Номенклатура КАК Номенклатура,
	               |	Продажи.Характеристика КАК Характеристика,
	               |	МАКСИМУМ(Продажи.Цена) КАК Цена,
	               |	СУММА(Продажи.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ЧекККМ.Товары КАК Продажи
	               |ГДЕ
	               |	Продажи.Ссылка.Проведен
	               |	И Продажи.Ссылка.СтатусЧекаККМ В(&СтатусыЧекаККМ)
	               |	И Продажи.Ссылка.Дата >= &датаН
	               |	И Продажи.Ссылка.Дата <= &датаК
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Номенклатура,
	               |	Продажи.Характеристика";
	
	
	СтатусыЧекаККМ = Новый Массив;
	СтатусыЧекаККМ.Добавить(Перечисления.СтатусыЧековККМ.Архивный);
	СтатусыЧекаККМ.Добавить(Перечисления.СтатусыЧековККМ.Пробитый);
	
	Запрос.УстановитьПараметр("СтатусыЧекаККМ",СтатусыЧекаККМ);
	Запрос.УстановитьПараметр("датаН",НачалоДня(датаН));
	Запрос.УстановитьПараметр("датаК",КонецДня(датаК));
	
	рез = Запрос.Выполнить().Выбрать();
	
	результ = Новый Массив;
	Пока рез.Следующий() Цикл
		результ.Добавить(
			Новый Структура("НоменклатураУИ,Номенклатура,ХарактеристикаУИ,Характеристика,Количество,Цена",
				Строка(рез.Номенклатура.УникальныйИдентификатор()),
				Строка(рез.Номенклатура),
				?(рез.Характеристика=неопределено,"",Строка(рез.Характеристика.УникальныйИдентификатор())),
				?(рез.Характеристика=неопределено,"",Строка(рез.Характеристика)),
				рез.Количество,
				рез.Цена
			)
		);
	КонецЦикла;
	
	Возврат результ;
КонецФункции


&НаКлиенте
Процедура ВыгрузитьВФайлОРП(Команда)	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать документы'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='JSON (*.json)|*.json'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки_ОРП", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);

		
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Выгрузки_ОРП(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			ОРП_ = ВыгрузитьВФайлНаСервереОРП();
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.ОткрытьФайл(ИмяФайла);
			ЗаписатьJSON(ЗаписьJSON, ОРП_);
			ЗаписьJSON.Закрыть();
			
			Сообщить("Файл сформирован: " + ИмяФайла)
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры

&НаСервере
Функция ВыгрузитьВФайлНаСервереОРП()
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
		|	ОтчетОРозничныхПродажахТовары.Характеристика КАК Характеристика,
		|	ОтчетОРозничныхПродажахТовары.Количество КАК Количество,
		|	ОтчетОРозничныхПродажахТовары.Цена КАК Цена,
		|	ОтчетОРозничныхПродажахТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
		|ГДЕ
		|	ОтчетОРозничныхПродажахТовары.Ссылка В(&МассивОРП)
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОРП", ОРП.ВыгрузитьЗначения());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	МассивОбщий	=	Новый Массив; 
	
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Склад", 	            Строка(ВыборкаСсылка.Ссылка.Магазин.СкладПродажи));
		СтруктураДанных.Вставить("СуммаДокумента", 	        ВыборкаСсылка.Ссылка.СуммаДокумента);
		СтруктураДанных.Вставить("Номер", 	                Строка(ВыборкаСсылка.Ссылка.Номер));
		СтруктураДанных.Вставить("Дата", 	                Строка(ВыборкаСсылка.Ссылка.Дата)); 
		
		Товары = Новый Массив;
		СтруктураДанных.Вставить("Товары", Товары);
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Товары.Добавить(Новый Структура("НоменклатураУИ, Номенклатура, ХарактеристикаУИ, Характеристика, Количество, Цена",
			Строка(ВыборкаДетальныеЗаписи.Номенклатура.УникальныйИдентификатор()),
			Строка(ВыборкаДетальныеЗаписи.Номенклатура),
			?(ВыборкаДетальныеЗаписи.Характеристика = Неопределено, "", Строка(ВыборкаДетальныеЗаписи.Характеристика.УникальныйИдентификатор())),
			?(ВыборкаДетальныеЗаписи.Характеристика = Неопределено, "", Строка(ВыборкаДетальныеЗаписи.Характеристика)),
			ВыборкаДетальныеЗаписи.Количество,
			ВыборкаДетальныеЗаписи.Цена));
		КонецЦикла;
		
			МассивОбщий.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат МассивОбщий;
	
КонецФункции
